# config.py
# -*- coding: utf-8 -*-

# =========================================
# TELEGRAM BOT
# =========================================

from dotenv import load_dotenv
import os

load_dotenv()

BOT_TOKEN = os.getenv("BOT_TOKEN")


# =========================================
# TEMPLATE
# =========================================

# PDF шаблон подяки
TEMPLATE_PDF = "templates/thanks.pdf"


# =========================================
# FONT
# =========================================

# Внутреннее имя шрифта
FONT_NAME = "Arial"

# Путь к TTF
FONT_PATH = "arialmt.ttf"

# Размер шрифта
FONT_SIZE = 62

# Межстрочный интервал
# Лучше брать из Photoshop
LINE_HEIGHT = 72


# =========================================
# TEXT POSITION
# =========================================

# Y координата НИЖНЕЙ строки
# Блок текста растёт ВВЕРХ
BOTTOM_Y = 1020


# =========================================
# PNG QUALITY
# =========================================

# 2 = нормально
# 3 = хорошо
# 4 = очень жирно
PNG_SCALE = 2


# =========================================
# LIMITS
# =========================================

MAX_TEXT_LENGTH = 300


# =========================================
# OUTPUT
# =========================================

PDF_OUTPUT_DIR = "output/pdf"

PNG_OUTPUT_DIR = "output/png"


# =========================================
# LOGGING
# =========================================

LOG_LEVEL = "INFO"